v2506/run/verification-studies/diederichsen-and-hatton/template/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          1e-3;
        maxIter         1000;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          1e-4;
        maxIter         1000;
    }

    C_S
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          1e-4;
        maxIter         1000;
    }

    C_CO2
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          1e-4;
        maxIter         1000;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 3;
    nCorrectors         2;
    consistent          yes;
    momentumPredictor   yes;

    residualControl
    {
        p               1e-6;
        U               1e-6;
        C_S             1e-12;
        C_CO2           1e-12;
    }
}

// ************************************************************************* //
